app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `mahasiswa`
SELECT COUNT(*) AS `numrows`
FROM `dosen`
SELECT COUNT(*) AS `numrows`
FROM `mata_kuliah`
SELECT COUNT(*) AS `numrows`
FROM `ruangan`
---
    public function index()
    {
        // 10. Panggil cek_login di awal
        if ($this->cek_login()) {
            return redirect()->to('auth');
        }

        $data['title'] = 'Dashboard Admin';

        // 11. CARA COUNTING DI CI4
        $data['count_mahasiswa'] = $this->db->table('mahasiswa')->countAllResults();
        $data['count_dosen'] = $this->db->table('dosen')->countAllResults();
        $data['count_matkul'] = $this->db->table('mata_kuliah')->countAllResults();
        $data['count_ruangan'] = $this->db->table('ruangan')->countAllResults();