app/Models/Admin_model.php

SELECT *
FROM `dosen`
---
    public function get_all_dosen()
    {
        return $this->db->table('dosen')->get()->getResultArray();

SELECT `j`.*, `mk`.`nama_mata_kuliah`, `d`.`nama` as `nama_dosen`, `r`.`nama_ruangan`
FROM `jadwal` `j`
JOIN `mata_kuliah` `mk` ON `j`.`id_mata_kuliah` = `mk`.`id_mata_kuliah`
JOIN `dosen` `d` ON `j`.`nidn` = `d`.`nidn`
JOIN `ruangan` `r` ON `j`.`id_ruangan` = `r`.`id_ruangan`
---
    public function get_all_jadwal()
    {
        // 9. Query join versi CI4
        $builder = $this->db->table('jadwal j');
        $builder->select('j.*, mk.nama_mata_kuliah, d.nama as nama_dosen, r.nama_ruangan');
        $builder->join('mata_kuliah mk', 'j.id_mata_kuliah = mk.id_mata_kuliah');
        $builder->join('dosen d', 'j.nidn = d.nidn');
        $builder->join('ruangan r', 'j.id_ruangan = r.id_ruangan');
        return $builder->get()->getResultArray();

SELECT *
FROM `jadwal`
WHERE `id_jadwal` = '1'
---
    public function get_jadwal_by_id($id)
    {
        return $this->db->table('jadwal')->where('id_jadwal', $id)->get()->getRowArray();

UPDATE `jadwal` SET `id_mata_kuliah` = '1', `id_ruangan` = '1', `nidn` = '123123123', `nama_kelas` = 'A', `hari` = 'Selasa', `jam` = '08:00-10:00'
WHERE `id_jadwal` = '1'
---
    public function update_jadwal($id, $data)
    {
        $this->db->table('jadwal')->where('id_jadwal', $id)->update($data);