app/Models/Dosen_model.php

SELECT `j`.`id_jadwal`, `j`.`nama_kelas`, `j`.`hari`, `j`.`jam`, `mk`.`kode_mata_kuliah`, `mk`.`nama_mata_kuliah`, `r`.`nama_ruangan`
FROM `jadwal` `j`
JOIN `mata_kuliah` `mk` ON `j`.`id_mata_kuliah` = `mk`.`id_mata_kuliah`
JOIN `ruangan` `r` ON `j`.`id_ruangan` = `r`.`id_ruangan`
WHERE `j`.`nidn` = '0987654321'
---
    public function get_jadwal_by_nidn($nidn)
    {
        // 4. Cara CI4 memulai query
        $builder = $this->db->table('jadwal j');
        $builder->select('j.id_jadwal, j.nama_kelas, j.hari, j.jam, mk.kode_mata_kuliah, mk.nama_mata_kuliah, r.nama_ruangan');
        $builder->join('mata_kuliah mk', 'j.id_mata_kuliah = mk.id_mata_kuliah');
        $builder->join('ruangan r', 'j.id_ruangan = r.id_ruangan');
        $builder->where('j.nidn', $nidn);

        // 5. Ganti ->result() menjadi ->getResultArray()
        return $builder->get()->getResultArray();

SELECT `mk`.`nama_mata_kuliah`, `j`.`nama_kelas`, `j`.`hari`, `j`.`jam`
FROM `jadwal` `j`
JOIN `mata_kuliah` `mk` ON `j`.`id_mata_kuliah` = `mk`.`id_mata_kuliah`
WHERE `j`.`id_jadwal` = '6'
---
    public function get_jadwal_detail($id_jadwal)
    {
        $builder = $this->db->table('jadwal j');
        $builder->select('mk.nama_mata_kuliah, j.nama_kelas, j.hari, j.jam');
        $builder->join('mata_kuliah mk', 'j.id_mata_kuliah = mk.id_mata_kuliah');
        $builder->where('j.id_jadwal', $id_jadwal);

        // 6. Ganti ->row() menjadi ->getRowArray() (untuk 1 baris data)
        return $builder->get()->getRowArray();

SELECT `m`.`nim`, `m`.`nama`, `rs`.`id_rencana_studi`, `rs`.`nilai_huruf`
FROM `rencana_studi` `rs`
JOIN `mahasiswa` `m` ON `rs`.`nim` = `m`.`nim`
WHERE `rs`.`id_jadwal` = '6'
---
    public function get_mahasiswa_by_jadwal($id_jadwal)
    {
        $builder = $this->db->table('rencana_studi rs');
        $builder->select('m.nim, m.nama, rs.id_rencana_studi, rs.nilai_huruf');
        $builder->join('mahasiswa m', 'rs.nim = m.nim');
        $builder->where('rs.id_jadwal', $id_jadwal);

        // 7. Ganti ->result() menjadi ->getResultArray()
        return $builder->get()->getResultArray();

SELECT *
FROM `nilai_mutu`
---
    public function get_nilai_mutu()
    {
        // 8. Cara CI4 untuk query simpel
        return $this->db->table('nilai_mutu')->get()->getResultArray();

UPDATE `rencana_studi` SET `nilai_huruf` = 'A'
WHERE `id_rencana_studi` = '30'
---
    public function update_nilai($id_rencana_studi, $nilai_huruf)
    {
        $data = [ // Ganti array() jadi []
            'nilai_huruf' => $nilai_huruf
        ];

        // 9. Cara CI4 untuk update
        $this->db->table('rencana_studi')
                 ->where('id_rencana_studi', $id_rencana_studi)
                 ->update($data);