app/Models/User_model.php

SELECT *
FROM `user`
WHERE `kode_peran` = '20232027'
 LIMIT 1
---
    public function check_user($kode_peran)
    {
        // Query builder-nya 99% sama
        return $this->where('kode_peran', $kode_peran)
                    ->first(); // first() lebih gampang daripada get()->row()